[
  {
    "id": "ELIA 2019-4317407283",
    "name": "ELIA 2019",
    "path": "/home/pierre/Documents/forschung/conferences/ELIA",
    "description": "This is a presentation at the ELIA conference 2019 titled \"Values in Software Development for Physical Classrooms\". This presentation centers around the process of developing Multimodal, a software designed and developed specifically around values related to teaching in physical classrooms.\n\nThe full software can be found here: https://multimodal.cc",
    "created": "2019-09-23T18:42:50.363Z",
    "topics": [
      {
        "concepts": [
          {
            "context": {
              "text": "Here are a couple of links for classes I currently teach.\n\nhttps://github.com/periode/digital-culture-2019\n\nhttps://github.com/periode/augmenting-gallery"
            },
            "name": "introduction",
            "pages": [
              {
                "name": "Values in Software Development for Physical Classrooms",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "practicing / collaborating / performing / teaching",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "pierre.depaz@nyu.edu",
                    "type": "url",
                    "url": "mailto:pierre.depaz@nyu.edu"
                  },
                  {
                    "tag": "",
                    "text": "pierredepaz.net",
                    "type": "url",
                    "url": "https://pierredepaz.net"
                  },
                  {
                    "tag": "",
                    "text": "nyu / sciences po / filmuniversitaet konrad wolf",
                    "type": "txt"
                  }
                ],
                "writeup": {
                  "text": "What I'm going to talk about today is the process and result of developing a software specifically for classroom use. This has been an informal research project for the past couple of years, and is reaching an alpha version soon.\n\nThis is intended to be more of a discussion than a one-way talk, and therefore will leave some room to attendees to express their opinions, questions, doubts and hopes."
                }
              },
              {
                "name": "Plan for this morning",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "why? the state of classroom software",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "what? an overview of features",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "how? the potential of new media",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "at the same time: a short demo",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": ""
                }
              }
            ]
          },
          {
            "context": {
              "text": "https://www.nytimes.com/2003/12/14/magazine/2003-the-3rd-annual-year-in-ideas-powerpoint-makes-you-dumb.html\n\nhttp://bento.hult.edu/a-brief-history-of-powerpoint/\n\nhttps://www.edwardtufte.com/tufte/books_pp\n\nhttps://www.amazon.com/Sweating-Bullets-Notes-about-Inventing-PowerPoint-Gaskins-Robert/dp/0985142405/\n\nhttps://vsdesign.org/publications/pdf/non-scan-vsd-and-information-systems.pdf"
            },
            "name": "why",
            "pages": [
              {
                "name": "tech in classrooms",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "what kind of software do you use in classrooms?",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "what effect(s) have you noticed?",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": "Classrooms are more and more digitalized, obviously, but often these dynamics come from the top-down initiatives of \"one laptop per child\" or \"tablets for everyone\", and therefore often not in accordance with whatever it is that the teachers are students are looking for.\n\nThis software (or lack thereof) has some effect on how the classroom goes. One cannot imagine group exercises with a single white board, but rather with multiple white boards accross the room. One can hardly imagine a film class without a screen, or a dictation without a way to write symbols."
                }
              },
              {
                "name": "slideware in classrooms",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "why use slideware in classrooms? why not?",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": "Slides are about a particular kind of communication: active presentation and passive communication. It is a symbiosis between some of the ways that humans understand ideas: through seeing, reading and hearing (there is not yet a software solution for haptic or olfactive stimulation, unfortunately)."
                }
              },
              {
                "name": "the history of slideware",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "\"... I did not target other existing large groups of users of presentations, such as school teachers or military officers. ... I also did not plan to target people who were not existing users of presentations ... such as clergy and school children ... . Our focus was purely on business users, in small and large companies, from one person to the largest multinationals.\" - robert gaskins, designer of powerpoint",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": "PowerPoint was created in 1987 by Robert Gaskin, and was quickly picked up by Apple at first, and then bought by Microsoft. The reason that it became so popular so fast is not that this was a revolutionary approach, or a disruption, as some might say, but about the usability and the economic context.\n\nOn the one side, PowerPoint does something that everyone already did -business presentations- and at the same time it did it very __easily__, __broadly__ and __prettily__. On the other side, it did it at a particular moment in the life of Windows. Windows 3.0 needed something to stand out of the competition and Microsoft put its full PR effort behind it."
                }
              },
              {
                "name": "values in software",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "how can values be represented in technology?",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "how do values be represented in software?",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "what are the values that are specific to slideware?",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": "So the point here is not to decide whether or not PowerPoint is good or bad. The point is to figure out what PowerPoint was set out to do in the first place, and what we are making it do now, how distant are those two goals and how we can possibly find a solution in which what the tool that we're using helps us get closer to our goal.\n\nThe values that I found are specific to PowerPoint are: unidirectionality of communication, atomization of thought, emphasis on form, aim for the lowest common denominator.\n\nHow do values seep into software? Or into tools in general? Because tools are a way to do things (Weizenbaum), and there is never just one correct way of doing something, particularly when it comes to learning types. It's then a matter of realizing that tools afford ways to do things, and it makes it harder to do things differently. Put it like this, tools aren't that different from rules and regulations. Again, rules and regulations aren't a bad thing. The rule \"You should not kill\" is a pretty good one which has helped humans get along quite decently. Rules and regulations, just like tools, become harmful whenever they are not closely examined, taken for granted or, worse, as part of the natural order of things."
                }
              },
              {
                "name": "starting from values",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "value-sensitive design (VSD) is a software development paradigm which aims at putting a set of values as the starting point of any design work.",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": "Value-Sensitive Design is a process of putting values first in the development process. In the why-what-how questions, we can formulate it as such:\n\nwhat matters? (and to whom! which helps us identify the value set of all involved)\nwhy does it matter? (are there any preceeding values we should take into account?)\nhow do we best put these at the forefront? which design decisions are getting us closer to our goal?\n\nthe final aspect of value-sensitive design is that of iteration: there is from the start no right way to do something, so in order to proceed, one must continuously test and revise assumptions and design. which is exactly what happens in classrooms! we try an exercice once, see if it works. if it doesn't, we change it. if it does, we keep it, and we try to find out why it works, in order to benefit from it for other exercises.\n"
                }
              },
              {
                "name": "values in teaching",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "what are some of the values that are important to you when teaching?",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": "A value is that which is of great importance to you, and which you'd rather see maintained than abandoned. I like to think of them as goals and intents that the world would be better with, and worse without."
                }
              },
              {
                "name": "starting set of values",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "interactivity (core)",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "context-sensitivity (core)",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "medium-awareness (core)",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "non-linearity (revised)",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": "So now that we've explicited some of the values that we care about in the act of teaching, let me quickly state the ones that drove me to develop multimodal."
                }
              }
            ]
          },
          {
            "context": {
              "text": "http://www.immersence.com/publications/2003/2003-Mmorse.html\n\nhttp://delivery.acm.org/10.1145/2820000/2814466/a1-mottus.pdf\n\nhttps://nostarch.com/interactive.htm\n\nhttp://manovich.net/index.php/projects/language-of-new-media"
            },
            "name": "starting value set",
            "pages": [
              {
                "name": "interactivity",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "discussion",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "maieutics",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": "Interactivity, here, is understood as involvement, and the setting up of certain parameters, a certain environment, and which __needs to be completed__. There is a lot of writing about the interactivity of software, and it seems that what was \"interactive\" 5 years ago is now \"smart\" now. It might be a buzzword, but interactivity is essential to any human activity. Game Design Chris Crawford states that the most interactive system is that of a human discussion. The fact that it is both simple (children can do it) and complex (we still don't know exactly how it works) is astounding, and our tools should aim at supporting this exchange, in any way possible. Indeed, when discussions happens between a small group of people, it's easy to keep track, but when a larger group (e.g. a class) is involved, then being able to write down the main points of the discussion helps maintain the focus of the discussion.\n\nOne possible way is PowerPoint, which augments the speech of the presenter. But how about augmenting the speech of the presented? This is precisely what maieutics is, the development of the Socratic method, in which questions are asked to the presented in order to birth knowledge through them, and for them, rather than slamming it onto their ears and eyes.\n\nThe first value is therefore that of interactivity between people.\n\n"
                }
              },
              {
                "name": "contextuality",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "being aware of when, where and why something exists",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "being relevant before class, during class, and after class",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "being aware of the relationship between a course and a class",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": "Class is a particular moment in the learning process, but is in no way the only moment that students or teachers engage with the learning material. It might be in the course preparation, which involves significant amounts of research, filtering out relevant from less relevant information, and distilling ideas so that they can be discussed, rather than having to read a book out loud.\n\nBecause class is not the only moment that learning happens, a software for classrooms should take into account what happens before class (preparation) and after class (reviews)."
                }
              },
              {
                "name": "medium-awareness",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "modularity",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "variability",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "transcoding",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": "Finally, the last value is mostly aimed at the development process itself. we shouldn't copy an old medium with a new one. The story goes that, when movie cameras started to become popular, we did what we knew how to do so far: we put it on a tripod in front of a theater stage, and let it roll for the whole performance.\n\nI would argue that this is the same thing with slideware: we used to make printed slides, and we still reason in terms of print media, with marginal improvements including animations, videos and hyperlinks.\n\nLev Manovich, in his book The Language of New Media, details what makes new media \"new\". I've extracted some of those properties here (excluding numerical representation, and automation).\n\n- Modularity is the ability to break something into smaller components, and re-assemble these components differently. For example, a single page can be extracted and edited without having to change and re-print the whole structure.\n- Variability is the ability to have a component change given a certain set of circumstances. For instance, a topic can be given new values and affect the whole structure without having to rebuild that whole structure (think light mode vs. dark mode)\n- Transcoding is the ability to represent the same thing in different ways. A text can be described as a title in a context, or as a chapter heading in another context, or a footnote in yet another one.\n\nDesigning, developing and using software means keeping those into account, and trying to find how these can best support an optimal classroom experience.\n"
                }
              },
              {
                "name": "locality",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "\"...the greatest development of technics in the future will consist in using machines on a human scale, directly under human control, to fulfill with more exquisite adaptation, with a higher refinement of skill, the human needs that are to be served. [...] Much that is now in the realm of automatism and mass production will come back under directly personal control, not for abandoning the machine, but by using it to better purpose, not by quantifying, but by qualifying its further use.\"  - lewis mumford",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": ""
                }
              }
            ]
          },
          {
            "context": {
              "text": "https://lareviewofbooks.org/article/the-next-level-alexander-r-galloways-the-interface-effect/"
            },
            "name": "what",
            "pages": [
              {
                "name": "multimodal",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "how did it start?",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": "And so while I've been exposing to you the conceptual foundations for developing this software, I've actually started through empirical practice: the best classroom experience was always one during which I had to (clunkily) switch between multiple applications, in order to take notes (text edit), to draw (photoshop), to show references (web links) and follow a linear prorgression of thought (slideware).\n\nIf all of these were necessary to provide students, and myself, with the best working environment, then why couldn't all of these features be combined into one software, in order to allow for (1) a more unified thought process when preparing classes, (2) an easier alternative to exclusive slideware for those who might not be digital natives and (3) prevent getting lost or losing focus during class by switching betwen too many applications."
                }
              },
              {
                "name": "interactivity",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "typing / drawing",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "editing",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": "Interactivity, then, is manifested in two ways. First, we can write whatever is being said and highlight it with human drawings, the same way that we would use in a whiteboard, while at the same time streamlining the process of getting a pen, erasing previous content, re-organizing data.\n\nSecond, there is very little difference between \"presenter\" and \"editor\" modes. The point is for the teacher to see what the students will see, which implies that students could also see presenter notes during the class itself, if these are relevant. While hiding presenter notes from a presentation in classical slideware might come from the need to maintain both a rigid discourse (again, more presentation than exchange), and to prevent a clutter of information, it is possible to think of the teacher/student relationship as a non-hierarchical one: whatever the teacher sees, the student should also be able to see it, and such a relationship could be based on mutual respect of the ways of doing rather than on the withholding of information creating an imbalance of power."
                }
              },
              {
                "name": "context",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "a textbook, a slideshow, a whiteboard and a website can co-exist",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": "If text is text, if the language of new media teaches us that data can adapt to different circumstances, and if a class is just a different manifestation of a syllabus, and if class notes are a different manifestation of a class, shouldn't it be possible to write __something__ which encapsulates all three modes of being of knowledge (research, class and notes) and presents itself in different ways based on which moment it is currently being used?\n\nIn that sense, context is just the circumstances underwhich a certain ecosystem deploys some of its aspects, and removes other aspects, in order to focus on the matter at hand."
                }
              },
              {
                "name": "interfaces",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "deciding what to show, and when to show it",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": "The corollary to that is understanding the role of interfaces. The \"interface effect\", as Alexander Galloway put it in his eponymous work, is the effect through which an interface only presents a section of the underlying information, while at the same time appearing (if well-done) completely invisible.\n\nThe questions that should come with interfaces is: what can't I see? why not? would it help me to see it?\n\nThere is a fine-balance between restricting options (and therefore mode of thought) and overloading with information, but this is how value-sensitive design works: the value of showing exactly what is relevant when it is relevant is one that is only achieved through trial and error, success and failure.\n\nMultimodal, for example, started with a classical edit mode, and presenter mode, but that entered into conflict with my own value set, so these two got merged. The navigation was, at some point, always displayed, and this tended to distract the students from what was going to be discussed in class, and sometimes biased the class discussions, so I decided to show only the pages in the current concept discussed, and only the name of other concepts."
                }
              }
            ]
          },
          {
            "context": {
              "text": "https://github.com/periode/multimodal/"
            },
            "name": "how",
            "pages": [
              {
                "name": "the web is everywhere",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "electron",
                    "type": "url",
                    "url": "https://electronjs.org/"
                  },
                  {
                    "tag": "",
                    "text": "html5",
                    "type": "url",
                    "url": "https://developer.mozilla.org/en-US/docs/Web/Guide/HTML/HTML5"
                  },
                  {
                    "tag": "",
                    "text": "<canvas>",
                    "type": "url",
                    "url": "https://developer.mozilla.org/en-US/docs/Web/API/Canvas_API/Tutorial/Basic_usage"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": "So how was this done?\n\nThis is esentially an offline version of one of greatest changes in human cognition of this century: the web browser. The software library is called electron, and is a stripped down version of google chrome running as a standalone application. This is for two main reasons.\n\nThe first one, is the access to the HTML5 and Canvas APIs. HTML5 is the version of HTML which cemented support for multimedia content (audio, video, images) in a much more flexible and robust way than its predecessors. The Canvas API is the set of instructions that was made available to all developers to start programming graphics in a web page, and therefore using a web page as a white board."
                }
              },
              {
                "name": "the web is for everyone",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "open-source",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "change formats, appearances, features, etc.",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": "The second reason is that the languages in which this software is written are some of the most accessible and popular languages today: HTML, CSS and JavaScript.\n\nWhile there exists open-source presentation tools (Libre Office Impress), their code is so convoluted and technical that it becomes complicated for an average developer to contribute to it and develop it further. This stands at the exact opposite of what Value-Sensitive Design represents: iterative, specific, bite-sized increments in the development process.\n\nIf something doesn't work for someone, if the tool is being too regulatory, it becomes a lot easier to change it to suit anyone's needs."
                }
              }
            ]
          },
          {
            "context": {
              "text": ""
            },
            "name": "conclusion",
            "pages": [
              {
                "name": "next steps",
                "notes": [],
                "preps": [
                  {
                    "tag": "",
                    "text": "an interactive teaching tool which exists beyond the classroom",
                    "type": "txt"
                  },
                  {
                    "tag": "",
                    "text": "multimodal.cc",
                    "type": "url",
                    "url": "https://multimodal.cc"
                  },
                  {
                    "tag": "",
                    "text": "questions?",
                    "type": "txt"
                  }
                ],
                "tag": "",
                "writeup": {
                  "text": "Some of the next steps include automated archival of links (through WebRecorder), adding versions for semesters while keeping the original class, and developing online version which could be accessible on the web.\n\nYou can find more information, and a newsletter at https://multimodal.cc."
                }
              }
            ]
          }
        ],
        "created": "2019-09-23T18:42:50.369Z",
        "id": "new-topic-5411360051",
        "name": "Values in Software Development",
        "overview": {
          "text": "Discussion held at ELIA Stuttgart on the 26.09.2019 about the possibility to rethink the software that we use in classrooms, starting from a dedicated set of values."
        },
        "subject": {
          "created": "2019-09-23T18:42:50.363Z",
          "description": "This is a presentation at the ELIA conference 2019 titled \"Values in Software Development for Physical Classrooms\". This presentation centers around the process of developing Multimodal, a software designed and developed specifically around values related to teaching in physical classrooms.\n\nThe full software can be found here: https://multimodal.cc",
          "id": "ELIA 2019-4317407283",
          "name": "ELIA 2019",
          "path": "/home/pierre/Documents/forschung/conferences/ELIA",
          "topics": []
        },
        "updated": "2019-09-26T08:26:44.957Z"
      }
    ]
  }
]
